#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-rV5J4bSvD82HQMnU

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
digitalocean_droplet.main: Refreshing state... [id=196151282]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_record.opentracker: Refreshing state... [id=161872068]
digitalocean_record.root: Refreshing state... [id=126395676]
digitalocean_record.starling-listener: Refreshing state... [id=309272946]
digitalocean_record.starling-webhooks: Refreshing state... [id=309351439]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_domain.opentracker will be created
  + resource "digitalocean_domain" "opentracker" {
      + id   = (known after apply)
      + name = "opentracker.app"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # digitalocean_record.opentracker-ns1 will be created
  + resource "digitalocean_record" "opentracker-ns1" {
      + domain = (known after apply)
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "NS"
      + value  = "ns1.digitalocean.com."
    }

  # digitalocean_record.opentracker-ns2 will be created
  + resource "digitalocean_record" "opentracker-ns2" {
      + domain = (known after apply)
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "NS"
      + value  = "ns2.digitalocean.com."
    }

  # digitalocean_record.opentracker-ns3 will be created
  + resource "digitalocean_record" "opentracker-ns3" {
      + domain = (known after apply)
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "NS"
      + value  = "ns3.digitalocean.com."
    }

  # digitalocean_record.opentracker-root will be created
  + resource "digitalocean_record" "opentracker-root" {
      + domain = (known after apply)
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "104.248.174.224"
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

</details>